{"meta":{"title":"钟越的个人blog","subtitle":"","description":"","author":"钟越skr~","url":"https://keshao001.github.io","root":"/"},"pages":[],"posts":[{"title":"Personal Resume","slug":"resume","date":"2024-04-15T05:45:05.071Z","updated":"2024-04-16T13:10:08.337Z","comments":true,"path":"2024/04/15/resume/","permalink":"https://keshao001.github.io/2024/04/15/resume/","excerpt":"","text":"个人介绍 性别：男 年龄：23 电话：18810709973 邮箱：&#122;&#x79;&#x32;&#x30;&#x30;&#48;&#64;&#115;&#x74;&#x75;&#x2e;&#x70;&#x6b;&#x75;&#x2e;&#101;&#100;&#x75;&#x2e;&#x63;&#x6e; 地址：北京市大兴区 个人评价 知识面广泛：在经济学、统计学、计算机科学都有过系统性的学习，能够将所学知识应用到时间当中。 乐观积极：参加志愿者活动时长超过20h，有过班级干部、校园干部的经历，在学习之余不断到社会当中去时间，实习时长超过1年。 勤奋好学、迎难而上：不断学习新的知识，大学期间参加了各种竞赛，获得过省级、国家级等各种奖项。 教育经历 北京大学 本科第二学位 软件工程 2023.09 - 2025.07 GPA：3.50 核心课程：数据结构、数据库、计算机网络、计算机导论（ICS）、软件工程、信息安全、机器学习等 学习方向：java后端开发，数据分析 Githubd： [https://github.com/keshao001] 个人博客：[https://zhongyue08.com/] 上海财经大学 本科 金融学 2018.09-2022.07 学习方向：金融学、应用统计 专业课程：货币金融、公司金融、宏观经济学、计量经济学、固定收益证券、投资银行学、财务会计、管理会计等 竞赛经历：第十一届全国大学生数学竞赛三等奖、第十一届上海市大学生数学竞赛三等奖 奖学金：湖北惠农公益基金奖学金 获得证书：证券从业资格证书 校园经历：金融学院学习委员、计算机协会部长 计算机技能 掌握Spring、SpringBoot 、SpringMVC、Mybatis等主流java开发框架； 掌握NumPy、Pandas、Sklearn等主流Python库的基本使用； 掌握Linux环境下常用命令及相关工具的使用（docker、vim、git等）; 掌握常见数据结构及算法，如排序、动态规划、回溯、贪心算法； 掌握常见数据库MySql&#x2F;Redis，了解MapReduce&#x2F;HIVE&#x2F;Spark等大数据存储与计算框架； 实习经历 北京卓视智通 大数据开发实习生 2024.01-2024.04 以图搜图架构调优：1.将实时图片进行向量化，生成 2048 个维度的向量，采用 milvus 数据 库进行存储；2.采用余弦相似度算法进行向量的匹配，输出前 10 个相似度最高的图片；3. 更换数据库后能够达到数据量 20 万级，匹配时间少于 10ms； 数据库优化：在公司的服务器上面部署 milvus 特征向量数据库，完成写入、读取数据库的 接口开发。 民生证券 固定收益证券 2023.07-2023.09 研报撰写：独立完成研报《城投主体研究与分析系列：多视角再看主体：贵州篇》，从地方 政策以及股权关系梳理贵州城投的发展过程，发现贵州地市利差的涨跌幅变动较大，抗风险 能力较差，政策变化较快，平台结构变动较大： ​ 1、梳理贵州16年至23年总共159家城投公司的股权关系，绘制了股权关系图，总结股权结构的变化； ​ 2、绘制贵州共9个地市城投公司的地市利差图表，分析几次典型的信用债冲击给各地市利差带来的变化； ​ 3、查找贵州近三年的地市政策，梳理贵州各地市的政策调整变化，分析未来几年各地市的发债状况； 地区研究：完成北京、上海、贵州从16年到最近的地市利差变化，分析几次典型信用债冲击带来的影响。 华西证券 行业研究所 2022.01-2022.05 研报撰写：参与撰写研报《滨江集团：深耕浙江强品质，稳中有进优等生》，从公司股权关 系、公司战略、财务状况等方面进行分析，上调公司未来营收、EPS、PE 的预测，维持公司 “增持”的评级。 **资料整理: **使用wind以及相关网站了解市场行情，在excel上整理当天市场新闻，了解房地产市场政策变动的状况； 每月维护房地产数据库2次，收集每周的最新政策变化调整地产公司最新变动情况； 项目经历 喝了么校园订餐系统 java后端 2024.01-2024.05 技术栈：Springboot+Mybatis+Redis+maven+vue+Nginx 项目功能：为餐饮企业制定的一款 点餐外卖系统，包括系统管理平台和小程序应用端。其中系统管 理平台为内部员工服务，可对餐厅的菜品、套餐、订单、员工进行管理维护，对餐厅的数据进行统 计；小程序端主要提供给消费者使用，可以实现在线浏览菜品、添加购物车、下单、支付等功能。 项目亮点：管理端和移动端都使用 JWT 令牌完成身份验证；使用 SpringCache 和 Redis 实现缓存功 能，将菜品数据缓存在 Redis 中，缓解 MySQL 性能问题。 高管股权激励对公司绩效的影响 数据分析 2022.01-2022.05 项目概述： 股权激励是用来解决公司的经营权与控制权相分离而产生的委托代理问题，需要验证具体的实施效果； 股权激励主要有限制性股票和股票期权两种不同方式，需要具体来分析它们实施效果的差异； 数据分析： 采用python在学校的数据库上爬取数据，运用sql提取关键数据，总共可以得到600+的数据量； 运用Tableau以及SPSS等软件进行数据的可视化操作，对数据采用采用大样本分析； 运用统计学中多元回归方法进行分析，对结果进行多重共线性检验和异方差检验； 校园经历 学习委员 班级干部 2018.09-2019.09 与老师进行沟通，负责班级学习任务的传达与交付；成立学习帮助小组，提升班级学习成绩，获得同学一致好评。 计算机协会部长 校园干部 2020.09-2021.09 组织活动：在公众号上面发布一些学习资料来帮助提升社员对于计算机学习兴趣；课后组织计算机技能比赛，提高同学兴趣； 开展培训：开展培训班帮助社员通过计算机等级考试，获得好评；帮助同学解决一些软件的使用问题，从而提高效率；","categories":[],"tags":[]}],"categories":[],"tags":[]}